const TEMPLATE_FILES = [
  {
    "file": 'Верстати.json',
    "code": `{
      "Верстати": {
        "columns": [
          "Модель верстату",
          "Шифр верстату",
          "Ім'я верстату",
          "Код операції"
        ],
        "values": [
          {
            "Модель верстату": "Модель 1",
            "Шифр верстату": "232135",
            "Ім'я верстату": "Ім'я верстату",
            "Код операції": "12"
          }
        ],
        "keyword": {
          "table": "Операції",
          "primary_key": "Назва операції",
          "target_column": "Код операції"
        }
      }
    }`
  },
  {
    "file": "Вимірювальні інструменти.json",
    "code": `{
      "Вимірювальні інструменти": {
        "columns": [
          "Інформація"
        ],
        "values": []
      }
    }`
  },
  {
    "file": "Заготівка.json",
    "code": `{
      "Заготівка": {
        "columns": [
          "ДСТУ",
          "Тип заготівки",
          "Номер"
        ],
        "values": [
          {
            "ДСТУ": "",
            "Тип заготівки": "Прокат листовий",
            "Номер": "1"
          }
        ]
      }
    }`
  },
  {
    "file": "Інструменти.json",
    "code": `{
      "Інструменти": {
        "columns": [
          "Назва інструменту",
          "Код операції",
          "Категорія"
        ],
        "values": [
          {
            "Назва інструменту": "інструмент 1",
            "Код операції": "12",
            "Категорія": "P01"
          }
        ],
        "keyword": {
          "table": "Операції",
          "primary_key": "Назва операції",
          "target_column": "Назва операції"
        }
      }
    }`
  },
  {
    "file": "ІОП.json",
    "code": `{
      "ІОП": {
        "columns": [
          "Назва",
          "Код операції"
        ],
        "values": []
      }
    }`
  },
  {
    "file": "Матеріал.json",
    "code": `{
      "Матеріал": {
        "columns": [
          "Категорія",
          "Hb (твердість по Брюнелю)",
          "ДСТУ",
          "Матеріал",
          "Номер"
        ],
        "values": []
      }
    }`
  },
  {
    "file": "МОР.json",
    "code": `{
      "МОР": {
        "columns": [
          "Порядковий номер",
          "Назва речовини"
        ],
        "values": []
      }
    }`
  },
  {
    "file": "Нормоконтроль.json",
    "code": `{
      "Нормоконтроль": {
        "columns": [
          "ПІБ"
        ],
        "values": []
      }
    }`
  },
  {
    "file": "Операції.json",
    "code": `{
      "Операції": {
        "columns": [
          "Код операції",
          "Ім'я операції"
        ],
        "values": [
          {
            "Код операції": "12",
            "Ім'я операції": "Допоміжна"
          }
        ]
      }
    }`
  },
  {
    "file": "Перевіряє та затверджує.json",
    "code": `{
      "Перевіряє та затверджує": {
        "columns": [
          "ПІБ"
        ],
        "values": []
      }
    }`
  },
  {
    "file": "Переходи.json",
    "code": `{
      "Переходи": {
        "columns": [
          "Назва переходу",
          "Назва операції",
          "Код операції"
        ],
        "values": [
          {
            "Назва переходу": "Встановити заготовку на верстаті закріпити і зняти після оброблення",
            "Назва операції": "Допоміжна",
            "Код операції": "12"
          }
        ],
        "keyword": {
          "table": "Операції",
          "primary_key": "Назва операції",
          "target_column": "Код операції"
        }
      }
    }`
  },
  {
    "file": "Посада.json",
    "code": `{
      "Посада": {
        "columns": [
          "Посада"
        ],
        "values": []
      }
    }`
  },
  {
    "file": "Пристрої.json",
    "code": `{
      "Пристрої": {
        "columns": [
          "Ім'я пристрою",
          "Порядковий номер"
        ],
        "values": []
      }
    }`
  },
  {
    "file": "Професії.json",
    "code": `{
      "Професії": {
        "columns": [
          "Код операції",
          "№ професії",
          "Назва професії"
        ],
        "values": [
          {
            "Код операції": "12",
            "№ професії": "2",
            "Назва професії": "Верстальник"
          }
        ],
        "keyword": {
          "table": "Операції",
          "primary_key": "Назва операції",
          "target_column": "Код операції"
        }
      }
    }`
  }
];
